# -*- coding: utf-8 -*-

# 按照从上往下，从左往右的顺序排序,最外0，，，next，previous，First_Child,Parent,,,没有就-1

# 轮廓检索模式 Contour Retrieval Mode

# 一行一轮廓，里边的数字是轮廓序号

# RETR_LIST
# 人人平等
# if you are not using any hierarchy features.
'''>>> hierarchy
array([[[ 1, -1, -1, -1],
        [ 2,  0, -1, -1],
        [ 3,  1, -1, -1],
        [ 4,  2, -1, -1],
        [ 5,  3, -1, -1],
        [ 6,  4, -1, -1],
        [ 7,  5, -1, -1],
        [-1,  6, -1, -1]]])'''

# RETR_ESTERNAL
# 第0级
'''>>> hierarchy
array([[[ 1, -1, -1, -1],
        [ 2,  0, -1, -1],
        [-1,  1, -1, -1]]])'''


# RET_CCOMP
# 二级划分，，1 → 2 → 1 → 2
'''>>> hierarchy
array([[[ 3, -1,  1, -1],
        [ 2, -1, -1,  0],
        [-1,  1, -1,  0],
        [ 5,  0,  4, -1],
        [-1, -1, -1,  3],
        [ 7,  3,  6, -1],
        [-1, -1, -1,  5],
        [ 8,  5, -1, -1],
        [-1,  7, -1, -1]]])'''

# RETR_TREE
# 树
'''>>> hierarchy
array([[[ 7, -1,  1, -1],
        [-1, -1,  2,  0],
        [-1, -1,  3,  1],
        [-1, -1,  4,  2],
        [-1, -1,  5,  3],
        [ 6, -1, -1,  4],
        [-1,  5, -1,  4],
        [ 8,  0, -1, -1],
        [-1,  7, -1, -1]]])'''


